-- phpMyAdmin SQL Dump
-- version 3.5.1
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1
-- Время создания: Мар 27 2017 г., 09:26
-- Версия сервера: 5.5.25
-- Версия PHP: 5.3.13

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `hotel`
--

-- --------------------------------------------------------

--
-- Структура таблицы `klient`
--

CREATE TABLE IF NOT EXISTS `klient` (
  `id` int(6) unsigned NOT NULL AUTO_INCREMENT,
  `fam` varchar(20) CHARACTER SET cp1251 COLLATE cp1251_bin NOT NULL,
  `nam` varchar(20) COLLATE cp1251_general_cs NOT NULL,
  `otc` varchar(20) COLLATE cp1251_general_cs NOT NULL,
  `pass` int(4) unsigned zerofill NOT NULL,
  `pasn` int(6) unsigned zerofill NOT NULL,
  `pdat` date NOT NULL,
  `pwho` varchar(50) COLLATE cp1251_general_cs NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_cs AUTO_INCREMENT=40 ;

--
-- Дамп данных таблицы `klient`
--

INSERT INTO `klient` (`id`, `fam`, `nam`, `otc`, `pass`, `pasn`, `pdat`, `pwho`) VALUES
(21, 'Иванов', 'Иван', 'Иванович', 4444, 000000, '2012-12-12', 'Каким-то УВД какого-то города'),
(22, 'Иванов', 'Иван', 'Иванович', 0000, 000000, '2012-12-12', 'Каким-то УВД какого-то города'),
(23, 'Михайлов', 'Иван', 'Иванович', 4444, 1010101, '2012-12-12', 'Не-помню-каким УВД'),
(24, 'Иванов', 'Иван', 'Иванович', 0000, 000000, '2012-12-12', 'Не-помню-каким УВД'),
(25, 'Иванов', 'Иван', 'Иванович', 0000, 000000, '2012-12-12', 'Не-помню-каким УВД'),
(26, 'Петров', 'Иван', 'Иванович', 0000, 000000, '2012-12-12', 'Не-помню-каким УВД'),
(27, 'Иванов', 'Иван', 'Иванович', 0000, 000000, '2012-12-12', 'Каким-то УВД какого-то города'),
(28, 'Иванов', 'Иван', 'Иванович', 0000, 000000, '2012-12-12', 'Каким-то УВД какого-то города'),
(29, 'Иванов', 'Иван', 'Иванович', 0000, 000000, '2012-12-12', 'Каким-то УВД какого-то города'),
(30, 'Иванов', 'Иван', 'Иванович', 0000, 000000, '2012-12-12', 'Каким-то УВД какого-то города'),
(31, 'Иванов', 'Иван', 'Иванович', 0000, 000000, '2012-12-12', 'Каким-то УВД какого-то города'),
(32, 'Петров', 'Иван', 'Иванович', 0000, 000000, '2012-12-12', 'Не-помню-каким УВД'),
(33, 'Иванов', 'Иван', 'Иванович', 0000, 000000, '2012-12-12', 'Не-помню-каким УВД'),
(34, 'Иванов', 'Иван', 'Иванович', 0000, 000000, '2012-12-12', 'Каким-то УВД какого-то города'),
(35, 'Иванов', 'Иван', 'Иванович', 0000, 000000, '2012-12-12', 'Каким-то УВД какого-то города'),
(36, 'Иванов', 'Пётр', 'Иванович', 0000, 000000, '2012-12-12', 'Кем-то главным'),
(37, 'Иванов', 'Иван', 'Петрович', 0000, 000000, '2012-12-12', 'Не-помню-каким УВД'),
(38, 'Иванов', 'Иван', 'Иванович', 0000, 000000, '2012-12-12', 'Не-помню-каким УВД'),
(39, 'Иванов', 'Иван', 'Иванович', 0000, 76543210, '2012-12-12', 'Каким-то УВД какого-то города');

-- --------------------------------------------------------

--
-- Структура таблицы `number`
--

CREATE TABLE IF NOT EXISTS `number` (
  `id` int(4) unsigned NOT NULL AUTO_INCREMENT,
  `room` int(4) unsigned NOT NULL,
  `place` int(1) unsigned NOT NULL,
  `class` int(1) unsigned NOT NULL,
  `floor` int(1) unsigned NOT NULL,
  `price` int(4) unsigned NOT NULL,
  `busy` int(1) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=cp1251 AUTO_INCREMENT=44 ;

--
-- Дамп данных таблицы `number`
--

INSERT INTO `number` (`id`, `room`, `place`, `class`, `floor`, `price`, `busy`) VALUES
(1, 101, 2, 2, 1, 450, 0),
(2, 102, 2, 2, 1, 450, 0),
(4, 103, 1, 1, 1, 565, 0),
(5, 104, 1, 1, 1, 565, 0),
(6, 105, 3, 2, 1, 690, 0),
(7, 106, 3, 2, 1, 690, 0),
(8, 107, 2, 2, 1, 620, 0),
(9, 108, 2, 2, 1, 620, 0),
(10, 201, 2, 0, 2, 1120, 0),
(11, 202, 2, 0, 2, 1120, 0),
(12, 203, 1, 1, 2, 850, 0),
(13, 204, 1, 1, 2, 850, 0),
(14, 205, 2, 1, 2, 940, 0),
(15, 206, 2, 1, 2, 940, 0),
(16, 207, 2, 1, 2, 940, 0),
(17, 208, 2, 1, 2, 940, 0),
(18, 211, 3, 0, 2, 1720, 0),
(19, 212, 3, 0, 2, 1720, 0),
(20, 321, 1, 0, 3, 960, 0),
(21, 322, 1, 0, 3, 960, 0),
(22, 301, 2, 0, 3, 1120, 0),
(23, 302, 2, 0, 3, 1120, 0),
(24, 303, 1, 1, 3, 850, 0),
(25, 304, 1, 1, 3, 850, 0),
(26, 305, 2, 1, 3, 940, 0),
(27, 306, 2, 1, 3, 940, 0),
(28, 307, 2, 1, 3, 940, 0),
(29, 308, 2, 1, 3, 940, 0),
(30, 311, 1, 0, 3, 960, 0),
(31, 312, 1, 0, 3, 960, 0),
(32, 421, 1, 0, 4, 960, 0),
(33, 422, 1, 0, 4, 960, 0),
(34, 401, 2, 0, 4, 1120, 0),
(35, 402, 2, 0, 4, 1120, 0),
(36, 403, 1, 1, 4, 850, 0),
(37, 404, 1, 1, 4, 850, 0),
(38, 405, 3, 1, 4, 1120, 0),
(39, 406, 3, 1, 4, 1120, 0),
(40, 407, 2, 1, 4, 940, 0),
(41, 408, 2, 1, 4, 940, 0),
(42, 411, 2, 1, 4, 960, 0),
(43, 412, 2, 1, 4, 960, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `order`
--

CREATE TABLE IF NOT EXISTS `order` (
  `id` int(6) unsigned NOT NULL AUTO_INCREMENT,
  `n_kl` int(4) unsigned NOT NULL,
  `n_nom` int(4) unsigned NOT NULL,
  `data` date NOT NULL,
  `dout` date NOT NULL,
  `sum` int(8) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=cp1251 AUTO_INCREMENT=51 ;

--
-- Дамп данных таблицы `order`
--

INSERT INTO `order` (`id`, `n_kl`, `n_nom`, `data`, `dout`, `sum`) VALUES
(1, 1, 5, '2017-03-25', '2017-03-30', 0),
(29, 17, 5, '2017-05-01', '2017-05-02', 1200),
(30, 18, 22, '2017-03-26', '2017-03-27', 1120),
(31, 19, 11, '2017-03-26', '2017-03-27', 1120),
(32, 20, 22, '2017-03-26', '2017-03-27', 1120),
(33, 22, 11, '2017-03-26', '2017-03-27', 1120),
(34, 23, 23, '2017-03-26', '2017-03-27', 1120),
(35, 24, 10, '2017-03-26', '2017-03-27', 1120),
(36, 25, 10, '2017-03-26', '2017-03-27', 1120),
(37, 26, 10, '2017-03-26', '2017-03-27', 1120),
(38, 27, 11, '2017-03-26', '2017-03-27', 1120),
(39, 28, 11, '2017-03-26', '2017-03-27', 1120),
(40, 29, 11, '2017-03-26', '2017-03-27', 1120),
(41, 30, 11, '2017-03-26', '2017-03-27', 1120),
(42, 31, 11, '2017-03-26', '2017-03-27', 1120),
(43, 32, 22, '2017-03-26', '2017-03-27', 1120),
(44, 33, 11, '2017-03-26', '2017-03-27', 1120),
(45, 34, 26, '2017-03-27', '2017-03-28', 940),
(46, 35, 26, '2017-03-27', '2017-03-28', 940),
(47, 36, 23, '2017-03-27', '2017-03-28', 1120),
(48, 37, 22, '2017-03-27', '2017-03-28', 1120),
(49, 38, 16, '2017-03-27', '2017-03-28', 940),
(50, 39, 15, '2017-03-27', '2017-03-28', 940);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
